Tekla.Structures.Drawing.DetailMark.DetailMarkAttributes.BoundaryColor
The detail mark boundary color.

Tekla.Structures.Drawing.DetailMark.DetailMarkAttributes.BoundaryLineType
The detail mark boundary line type.